In [1]:
import numpy as np
import pandas as pd

# DataFrame 생성하기
- 데이타프레임이름 = pd.DataFrame(딕셔너리리스트)
- 딕셔너리 리스트 : 딕셔너리 구조인데 값이 리스트인 구조
- 데이타프레임을 딕셔너리 리스트로 만들면 키는 컬럼명으로 지정

# 딕셔너리 리스트 생성하기
```
{키1:[값1,값2,값3],카2:[값1,값2,값3]}
```

In [2]:
data = { 'name':['a','b','c','d','e'],
       'year':[2014,2015,2016,2017,2018],
        'points':[1.5,2.3,4.7,7.6,3.14]}
data

{'name': ['a', 'b', 'c', 'd', 'e'],
 'year': [2014, 2015, 2016, 2017, 2018],
 'points': [1.5, 2.3, 4.7, 7.6, 3.14]}

In [3]:
data['name']

['a', 'b', 'c', 'd', 'e']

In [4]:
data['year']

[2014, 2015, 2016, 2017, 2018]

In [5]:
data['points']

[1.5, 2.3, 4.7, 7.6, 3.14]

In [6]:
df = pd.DataFrame(data)
df

  name  year  points
0    a  2014    1.50
1    b  2015    2.30
2    c  2016    4.70
3    d  2017    7.60
4    e  2018    3.14

# DataFrame 생성하기 - Nested Dictionary 이용
- Nested Dictionary 란

In [7]:
pop = {'Nevada':{2001:2.4,2002:2.9},
      'Ohio':{2000:1.5,2001:1.7}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7}}

In [8]:
pop['Nevada']

{2001: 2.4, 2002: 2.9}

In [9]:
df = pd.DataFrame(pop)
df

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   NaN

# 데이터 프레임의 컬럼은 시리즈이다.

In [10]:
df['Nevada']

2000    NaN
2001    2.4
2002    2.9
Name: Nevada, dtype: float64

In [11]:
type(df['Nevada'])

pandas.core.series.Series

# 데이터프레임의 데이터형 확인하기

In [12]:
type(df)

pandas.core.frame.DataFrame

# 행으로 필터링하기
- 데이터프레임명.iloc[인덱스번호,:]
- 데이터프레임명.loc[행의인덱스이름]

In [13]:
df.iloc[0,:]

Nevada    NaN
Ohio      1.5
Name: 2000, dtype: float64

In [14]:
df.loc[2000]

Nevada    NaN
Ohio      1.5
Name: 2000, dtype: float64

# DataFrame의 속성
- 데이터프레임의 행 요소 조회 - 데이터프레임이름.index
- 데이터프레임의 열 요소 조회 - 데이터프레임이름.columns
- 데이터프레임의 요소 값 조회 - 데이터프레임이름.values => 넘파이배열
- 데이터프레임의 전체갯수 - 데이터프레임이름.size => 정수
- 데이터프레임의 구조 - 데이터프레임이름.shape = >튜플
- 데이터프레임의 컬렴별 데이터형 - 데이터프레임이름[컬럼명].dtype

In [15]:
data = { 'name':['a','b','c','d','e'],
       'year':[2014,2015,2016,2017,2018],
        'points':[1.5,2.3,4.7,7.6,3.14]}

In [16]:
df = pd.DataFrame(data)
df

  name  year  points
0    a  2014    1.50
1    b  2015    2.30
2    c  2016    4.70
3    d  2017    7.60
4    e  2018    3.14

In [17]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
df.columns

Index(['name', 'year', 'points'], dtype='object')

### 데이터프레임의 실제 값은 넘파이배열 형태이다.

In [19]:
df.values

array([['a', 2014, 1.5],
       ['b', 2015, 2.3],
       ['c', 2016, 4.7],
       ['d', 2017, 7.6],
       ['e', 2018, 3.14]], dtype=object)

In [20]:
type(df.values)

numpy.ndarray

In [21]:
df.size

15

In [22]:
df.shape

(5, 3)

In [23]:
df['name'].dtype

dtype('O')

In [24]:
df['year'].dtype

dtype('int64')

In [25]:
df['points'].dtype

dtype('float64')

# DataFrame의 행, 열의 대표이름 정의하기
- 데이터프레임의 행이름 정의 - 데이터프레임이름.index.name
- 데이터프레임의 열이름 정의 - 데이터프레임이름.columns.name

In [26]:
# 딕셔너리 리스트 정의
data = {'Math':[100,45,89,40],
       'Eng':[80,95,88,77],
       'Sci':[100,77,89,100]}

# 인덱스 지정 => 데이터프레임
df = pd.DataFrame(data, index=['Julia', 'Maria','Jhon','Tom'])
df

       Math  Eng  Sci
Julia   100   80  100
Maria    45   95   77
Jhon     89   88   89
Tom      40   77  100

In [27]:
df.index.name = '[Student]'
df.columns.name = '[Subject]'
df

[Subject]  Math  Eng  Sci
[Student]
Julia       100   80  100
Maria        45   95   77
Jhon         89   88   89
Tom          40   77  100

# Dataframe 의 재정의 - 새로운 컬럼추가
- 데이터 프레임 생성시 열 값이 없는 경우에는 NaN

In [28]:
data = { 'name':['a','b','c','d','e'],
       'year':[2014,2015,2016,2017,2018],
        'points':[1.5,2.3,4.7,7.6,3.14]}

df = pd.DataFrame(data, columns=['year','name','points','penalty'], index=['one','two','three','four','five'])
df

       year name  points penalty
one    2014    a    1.50     NaN
two    2015    b    2.30     NaN
three  2016    c    4.70     NaN
four   2017    d    7.60     NaN
five   2018    e    3.14     NaN

## 컬럼값 새로 지정

In [29]:
df['penalty'] = [1,4,2,2,1]
df

       year name  points  penalty
one    2014    a    1.50        1
two    2015    b    2.30        4
three  2016    c    4.70        2
four   2017    d    7.60        2
five   2018    e    3.14        1

# 컬럼 추가하기2
```
데이터프레임이름[새로운컬럼명] = [값1,값2 ....]
```

In [30]:
df['Gender'] = ['Female','Female','Male','Male','Male']
df

       year name  points  penalty  Gender
one    2014    a    1.50        1  Female
two    2015    b    2.30        4  Female
three  2016    c    4.70        2    Male
four   2017    d    7.60        2    Male
five   2018    e    3.14        1    Male

### 데이터 프레임의 컬럼 순서 변경하기
```
데이터프레임명.columns =[컬럼값1,컬럼값2 ...]

컬럼값이 기존에 있다면 순서 교체
```

In [31]:
df.columns = ['name','year','points','penalty','Gender']
df

       name year  points  penalty  Gender
one    2014    a    1.50        1  Female
two    2015    b    2.30        4  Female
three  2016    c    4.70        2    Male
four   2017    d    7.60        2    Male
five   2018    e    3.14        1    Male

# DataFrame 정보 알아보기
- 데이타 프레임이름.describe

In [32]:
df.describe

<bound method NDFrame.describe of        name year  points  penalty  Gender
one    2014    a    1.50        1  Female
two    2015    b    2.30        4  Female
three  2016    c    4.70        2    Male
four   2017    d    7.60        2    Male
five   2018    e    3.14        1    Male>

# Dataframe 컬럼 필터링
- df[컬럼명]
- df.컬럼명
- 컬럼 추출시 시리즈(Series) 표시
- 다중필터링: 여러개의 컬럼을 필터링 시에는 겹대괄호 이용'[[...]]'
```
df[[컬럼명1,컬럼명2...]]
```

In [33]:
data = { 'name':['a','b','c','d','e'],
       'year':[2014,2015,2016,2017,2018],
        'points':[1.5,2.3,4.7,7.6,3.14]}
data

{'name': ['a', 'b', 'c', 'd', 'e'],
 'year': [2014, 2015, 2016, 2017, 2018],
 'points': [1.5, 2.3, 4.7, 7.6, 3.14]}

In [34]:
df[['year','points']]

      year  points
one      a    1.50
two      b    2.30
three    c    4.70
four     d    7.60
five     e    3.14

# 새로운 값 추가후 같은 값

In [35]:
data = {'Math':[100,45,89,40],
       'Eng':[80,95,88,77],
       'Sci':[100,77,89,100]}
df = pd.DataFrame(data)
df

   Math  Eng  Sci
0   100   80  100
1    45   95   77
2    89   88   89
3    40   77  100

In [36]:
df['Com'] = 50
df

   Math  Eng  Sci  Com
0   100   80  100   50
1    45   95   77   50
2    89   88   89   50
3    40   77  100   50

# 열 증가값

In [37]:
data = { 'name':['a','b','c','d','e'],
       'year':[2014,2015,2016,2017,2018],
        'points':[1.5,2.3,4.7,7.6,3.14]}

df = pd.DataFrame(data, columns=['year','name','points','penalty'], index=['one','two','three','four','five'])
df

       year name  points penalty
one    2014    a    1.50     NaN
two    2015    b    2.30     NaN
three  2016    c    4.70     NaN
four   2017    d    7.60     NaN
five   2018    e    3.14     NaN

In [45]:
df['penalty'] = np.arange(1,6)
df

       year name  points  penalty  debt  net_points  high_points
one    2014    a    1.50        1   NaN       -9.50        False
two    2015    b    2.30        2  -1.2       -9.70        False
three  2016    c    4.70        3   NaN       -8.30        False
four   2017    d    7.60        4  -1.5       -6.40        False
five   2018    e    3.14        5  -1.7      -11.86        False

# Series 이용해 DataFrame에 컬럼 추가하기
- 시리즈(Series) 생성시 행의 index 이름값 사용
- 생성된 시리즈를 컬럼 추가시 사용

In [46]:
s = pd.Series([-1.2, -1.5, -1.7], index=['two','four','five'])
s

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [40]:
df['debt']= s
df

       year name  points  penalty  debt
one    2014    a    1.50       11   NaN
two    2015    b    2.30       12  -1.2
three  2016    c    4.70       13   NaN
four   2017    d    7.60       14  -1.5
five   2018    e    3.14       15  -1.7

# Dataframe 기존 열의 값이용하여 새로운 열 추가하기

In [41]:
df

       year name  points  penalty  debt
one    2014    a    1.50       11   NaN
two    2015    b    2.30       12  -1.2
three  2016    c    4.70       13   NaN
four   2017    d    7.60       14  -1.5
five   2018    e    3.14       15  -1.7

In [47]:
df['net_points'] = df['points']-df['penalty']
df

       year name  points  penalty  debt  net_points  high_points
one    2014    a    1.50        1   NaN        0.50        False
two    2015    b    2.30        2  -1.2        0.30        False
three  2016    c    4.70        3   NaN        1.70        False
four   2017    d    7.60        4  -1.5        3.60        False
five   2018    e    3.14        5  -1.7       -1.86        False

In [48]:
df['high_points'] = df['net_points'] > 0
df

       year name  points  penalty  debt  net_points  high_points
one    2014    a    1.50        1   NaN        0.50         True
two    2015    b    2.30        2  -1.2        0.30         True
three  2016    c    4.70        3   NaN        1.70         True
four   2017    d    7.60        4  -1.5        3.60         True
five   2018    e    3.14        5  -1.7       -1.86        False

# 퀴즈

In [49]:
data = { 'Eng':[80,95,88,40],
       'Math':[100,45,89,30],
        'Sci':[100,77,89,100],
       'Kor':[50,50,50,50],
       'Music':[100,45,60,79]}

df = pd.DataFrame(data, columns=['Eng','Math','Sci','Kor', 'Music'], index=['Jullia','Maria','Jhon','Tom'])
df

        Eng  Math  Sci  Kor  Music
Jullia   80   100  100   50    100
Maria    95    45   77   50     45
Jhon     88    89   89   50     60
Tom      40    30  100   50     79

In [50]:
df['Total'] = df['Eng']+df['Math']+df['Sci']+df['Kor']+df['Music']
df

        Eng  Math  Sci  Kor  Music  Total
Jullia   80   100  100   50    100    430
Maria    95    45   77   50     45    312
Jhon     88    89   89   50     60    376
Tom      40    30  100   50     79    299

In [52]:
df['Avr'] = df['Total']/5
df

        Eng  Math  Sci  Kor  Music  Total   Avr
Jullia   80   100  100   50    100    430  86.0
Maria    95    45   77   50     45    312  62.4
Jhon     88    89   89   50     60    376  75.2
Tom      40    30  100   50     79    299  59.8

In [53]:
df['Pass'] = df['Avr'] > 70
df

        Eng  Math  Sci  Kor  Music  Total   Avr   Pass
Jullia   80   100  100   50    100    430  86.0   True
Maria    95    45   77   50     45    312  62.4  False
Jhon     88    89   89   50     60    376  75.2   True
Tom      40    30  100   50     79    299  59.8  False

In [54]:
df

        Eng  Math  Sci  Kor  Music  Total   Avr   Pass
Jullia   80   100  100   50    100    430  86.0   True
Maria    95    45   77   50     45    312  62.4  False
Jhon     88    89   89   50     60    376  75.2   True
Tom      40    30  100   50     79    299  59.8  False

# 칼럼 지우기

In [56]:
del df['penalty']
df

       year name  points
one    2014    a    1.50
two    2015    b    2.30
three  2016    c    4.70
four   2017    d    7.60
five   2018    e    3.14

# Dataframe : 행 추출
- 데이터프레임이름[start:end]
- 인덱스는 행 이름이나 숫자로 가능

In [57]:
data = { 'name':['a','b','c','d','e'],
       'year':[2014,2015,2016,2017,2018],
        'points':[1.5,2.3,4.7,7.6,3.14]}

df = pd.DataFrame(data, columns=['year','name','points','penalty'], index=['one','two','three','four','five'])
df

       year name  points penalty
one    2014    a    1.50     NaN
two    2015    b    2.30     NaN
three  2016    c    4.70     NaN
four   2017    d    7.60     NaN
five   2018    e    3.14     NaN

In [58]:
df['year']

one      2014
two      2015
three    2016
four     2017
five     2018
Name: year, dtype: int64

In [59]:
df[['year','name']]

       year name
one    2014    a
two    2015    b
three  2016    c
four   2017    d
five   2018    e

In [60]:
df[0:2]

     year name  points penalty
one  2014    a     1.5     NaN
two  2015    b     2.3     NaN

In [61]:
df['two':'four']

       year name  points penalty
two    2015    b     2.3     NaN
three  2016    c     4.7     NaN
four   2017    d     7.6     NaN

In [62]:
df.loc['two']

year       2015
name          b
points      2.3
penalty     NaN
Name: two, dtype: object

In [63]:
df.loc['two':'four']

       year name  points penalty
two    2015    b     2.3     NaN
three  2016    c     4.7     NaN
four   2017    d     7.6     NaN

# Dataframe: 특정 행의 특정열 추출 .loc 이용
- df.loc[행인덱스start:행인덱스end,컬럼명]

In [64]:
data = { 'name':['a','b','c','d','e'],
       'year':[2014,2015,2016,2017,2018],
        'points':[1.5,2.3,4.7,7.6,3.14]}

df2 = pd.DataFrame(data, columns=['year','name','points','penalty'], index=['one','two','three','four','five'])
df2

       year name  points penalty
one    2014    a    1.50     NaN
two    2015    b    2.30     NaN
three  2016    c    4.70     NaN
four   2017    d    7.60     NaN
five   2018    e    3.14     NaN

In [65]:
df2.loc['two':'four','points']

two      2.3
three    4.7
four     7.6
Name: points, dtype: float64

In [66]:
df2.loc[:,'year']

one      2014
two      2015
three    2016
four     2017
five     2018
Name: year, dtype: int64

In [68]:
df2.loc[:,['year','name']]

       year name
one    2014    a
two    2015    b
three  2016    c
four   2017    d
five   2018    e

In [72]:
df2.loc['three':'five','year':'points']

       year name  points
three  2016    c    4.70
four   2017    d    7.60
five   2018    e    3.14

# Dataframe: loc 이용, 행 추가

In [73]:
df

       year name  points penalty
one    2014    a    1.50     NaN
two    2015    b    2.30     NaN
three  2016    c    4.70     NaN
four   2017    d    7.60     NaN
five   2018    e    3.14     NaN

In [76]:
df.loc['six', :] = [2019, 'f', 4.0, 6]
df

         year name  points penalty
one    2014.0    a    1.50     NaN
two    2015.0    b    2.30     NaN
three  2016.0    c    4.70     NaN
four   2017.0    d    7.60     NaN
five   2018.0    e    3.14     NaN
six    2019.0    f    4.00       6

In [77]:
df.loc[:,'bonus']=[10,20,30,40,50,60]
df

         year name  points penalty  bonus
one    2014.0    a    1.50     NaN     10
two    2015.0    b    2.30     NaN     20
three  2016.0    c    4.70     NaN     30
four   2017.0    d    7.60     NaN     40
five   2018.0    e    3.14     NaN     50
six    2019.0    f    4.00       6     60

# Dataframe : iloc 이용, 행추출
- 데이타프레임이름.iloc[행인덱스순서] : 시리즈형태로 세로로 추출

In [78]:
df

         year name  points penalty  bonus
one    2014.0    a    1.50     NaN     10
two    2015.0    b    2.30     NaN     20
three  2016.0    c    4.70     NaN     30
four   2017.0    d    7.60     NaN     40
five   2018.0    e    3.14     NaN     50
six    2019.0    f    4.00       6     60

In [79]:
df.iloc[0]

year       2014
name          a
points      1.5
penalty     NaN
bonus        10
Name: one, dtype: object

# Dataframe : iloc 이용, 행, 컬럼 범위 추출
- 데이터프레임이름.iloc[행인덱스start: 행인덱스end, 컬럼start:컬럼end]
- 데이터프레임이름.iloc[[인덱스숫자1, 인덱스숫자2..],[컬럼인덱스 숫자1, 컬럼인덱스 숫자2...]]

In [80]:
df2

       year name  points penalty
one    2014    a    1.50     NaN
two    2015    b    2.30     NaN
three  2016    c    4.70     NaN
four   2017    d    7.60     NaN
five   2018    e    3.14     NaN

In [81]:
df2.iloc[3:5,0:2]

      year name
four  2017    d
five  2018    e

## 비 연속적인 행과 컬럼 추출
- 데이터프레임이름.iloc[[인덱스숫자1, 인덱스숫자2..],[컬럼인덱스 숫자1, 컬럼인덱스 숫자2...]]

In [82]:
df2.iloc[[0,1,3],[1,2]]

     name  points
one     a     1.5
two     b     2.3
four    d     7.6

In [83]:
df.iloc[:,1:4]

      name  points penalty
one      a    1.50     NaN
two      b    2.30     NaN
three    c    4.70     NaN
four     d    7.60     NaN
five     e    3.14     NaN
six      f    4.00       6

# 넘파이 2차원 배열을 이용하여 데이타프레임 만들기

In [84]:
dfTest = pd.DataFrame(np.random.randint(1,100,size=30).reshape(-1,5),
                     columns = ['col1','col2','col3','col4','col5'],
                     index = ['row1','row2','row3','row4','row5','row6'])
dfTest

      col1  col2  col3  col4  col5
row1    78    94     3    71    15
row2     6    76    97    41    60
row3    24    97     1    35    23
row4    50    89    24    72    72
row5    82    20    57    28    78
row6    66     8    31    33    32

In [86]:
dfTest.iloc[0]

col1    78
col2    94
col3     3
col4    71
col5    15
Name: row1, dtype: int32

In [88]:
dfTest.iloc[1:4]

      col1  col2  col3  col4  col5
row2     6    76    97    41    60
row3    24    97     1    35    23
row4    50    89    24    72    72

In [92]:
dfTest.iloc[:,4]

row1    15
row2    60
row3    23
row4    72
row5    78
row6    32
Name: col5, dtype: int32

In [90]:
dfTest.iloc[[0],[1,4]]

      col2  col5
row1    94    15

In [94]:
dfTest.iloc[[4,5],[2]]

      col3
row5    57
row6    31

# 행과 열 삭제하기
```
- 데이터프레임명.drop([행이름1, 행이름2 ...])
- 데이터프레임명.drop([열이름1, 열이름2 ...], axis=1)
- 데이터프레임명.drop(index=[],columns=[])
- 원본 데이터프레임에는 실제로 삭제되지 않는다
- 원본 데이터 프레임에도 삭제되길 원하면
 inplace = True 옵션을 추가해야한다.
```

In [95]:
dfTest2 = pd.DataFrame(np.random.randint(1,100,size=30).reshape(-1,5),
                     columns = ['col1','col2','col3','col4','col5'],
                     index = ['row1','row2','row3','row4','row5','row6'])
dfTest2

      col1  col2  col3  col4  col5
row1    69    89    91     9    80
row2    63    56    75    96     7
row3    42    39    17    91    66
row4    51    18    75    94    10
row5    50    74    82    39    18
row6    26    41    17    95    76

In [96]:
dfTest2.drop(['col5'],axis=1)

      col1  col2  col3  col4
row1    69    89    91     9
row2    63    56    75    96
row3    42    39    17    91
row4    51    18    75    94
row5    50    74    82    39
row6    26    41    17    95

In [97]:
dfTest.drop(columns = ['col4'])

      col1  col2  col3  col5
row1    78    94     3    15
row2     6    76    97    60
row3    24    97     1    23
row4    50    89    24    72
row5    82    20    57    78
row6    66     8    31    32

In [101]:
dfTest2.drop(columns = ['col5'],inplace = True)
dfTest2

      col1  col2  col3  col4
row1    69    89    91     9
row2    63    56    75    96
row3    42    39    17    91
row4    51    18    75    94
row5    50    74    82    39
row6    26    41    17    95

      col1  col2  col3  col4
row1    78    94     3    71
row2     6    76    97    41
row3    24    97     1    35
row4    50    89    24    72
row5    82    20    57    28
row6    66     8    31    33